export const DAILY_MISSION = 50;

export const DAILY_SHARE = 10;

export const WEEKLY_NAIL = 10;

export const MEMBER_POINT = {
  無: 0,
  小月卡: 56,
  大月卡: 106,
  "大＋小月卡": 162,
};

export const CONSORTIUM_MISSION = {
  冠軍: 300,
  亞軍: 280,
  季軍: 260,
  "4 - 10名": 230,
  "11 - 20名": 220,
  "21 - 30名": 210,
  "31 - 50名": 200,
  "51 - 70名": 180,
  "71 - 100名": 150,
  "101 - 200名": 130,
  "前5%": 100,
  "前5% - 10%": 80,
  "前10% - 20%": 60,
  "前20% - 30%": 50,
  "前30% - 50%": 40,
  其他名次: 30,
};

export const ARENA_POINT = {
  冠軍: 500,
  亞軍: 480,
  季軍: 450,
  "4-50名": 400,
  "51-100名": 350,
  "永恆的傳奇前2%": 320,
  "永恆的傳奇前5%": 300,
  "永恆的傳奇前10%": 280,
  "永恆的傳奇前20%": 260,
  "永恆的傳奇前30%": 240,
  "永恆的傳奇前50%": 220,
  "永恆的傳奇前100%": 200,
  顛覆未來之王3星: 180,
  顛覆未來之王2星: 170,
  顛覆未來之王1星: 160,
  靈感重構大師3星: 150,
  靈感重構大師2星: 140,
  靈感重構大師1星: 130,
  記憶創造者3星: 120,
  記憶創造者2星: 110,
  記憶創造者1星: 100,
  自由搭配師3星: 90,
  自由搭配師2星: 80,
  自由搭配師1星: 70,
  初心學徒: 50,
};

export const STAGE_POINT = {
  "第1名": 500,
  "2 - 5名": 450,
  "6 - 20名": 400,
  "21 - 100名": 350,
  "101 - 500 / 前1%": 300,
  "501 - 2000 / 前4%": 260,
  "2001 - 5000 / 前8%": 220,
  "5001 - 10000 / 前15%": 180,
  "10001 - 20000 / 前30%": 140,
  "20001 - 30000 / 前65%": 100,
  "30001 - 50000 / 前80%": 90,
  "前85%": 80,
  "前90%": 70,
  "前100%": 50,
};
